// Сложение всех чисел в массиве

// int sum(List<int> arr) {
//   if (arr.isEmpty) {
//     return 0;
//   }

//   int a = 0;

//   for (var i = 0; i < arr.length; i++) {
//     a += arr[i];
//   }
//   return a;
// }

// void main() =>
//     print(sum([213213, 3124124, 134311343113431134, -12321312412412413]));


//  ================================================================
// вывести слово в обратном порядке

// String reverseStr(String str) => str.split("").reversed.join("");

// void main() => print(reverseStr("hello"));


// =================================================================

// В этом простом задании вам дается число, и вы должны сделать его отрицательным. А может быть, число уже отрицательное?

/**
 * Примечания
Число может быть уже отрицательным, и в этом случае никаких изменений не требуется.
Ноль (0) не проверяется на наличие какого-либо конкретного знака. Отрицательные нули не имеют математического смысла.
 */
// num makeNegative(n) {
//   if(n >=0) {
//   return -n;
//   } else {
//     return n;
//   }
    
  
// }

// num makeNegative(n) => n >= 0? -n : n;

